
# Calculating Lead-Based Returns with Rule-Based Classification


## Business Problem

A game company wants to create level-based new customer definitions (personas) by using some features of its customers, and to create segments according to these new customer definitions and to estimate how much the new customers can earn on average according to these segments.

For example: It is desired to determine how much a 25-year-old male user from Turkey, who is an IOS user, can earn on average.


## Dataset Story

The Persona.csv dataset contains the prices of the products sold by an international game company and some demographic information of the users who buy these products. The data set consists of records created in each sales transaction. This means that the table is not deduplicated. In other words, a user with certain demographic characteristics may have made more than one purchase.

Price: Customer spend amount

Source: The type of device the customer is connecting to

Sex: Customer's gender

Country: Customer's country

Age: Customer's age

## Pre-Application Dataset

    PRICE   SOURCE   SEX COUNTRY  AGE

    39    android     male         bra     17

    39    android      male         bra       17

    49    android     male        bra     17

    29    android     male         tur    17
 
    49    android     male        tur      17

## Post Application Dataset

    customers_level_based        PRICE SEGMENT
    BRA_ANDROID_FEMALE_0_18  1139.800000       A
    BRA_ANDROID_FEMALE_19_23  1070.600000       A
    BRA_ANDROID_FEMALE_24_30   508.142857       A
    BRA_ANDROID_FEMALE_31_40   233.166667       C
    BRA_ANDROID_FEMALE_41_66   236.666667       C


# PROJECT TASKS


## TASK 1: Answer the following questions.

In [2]:
import pandas as pd
import numpy as np

### Question 1: Read the persona.csv file and show the general information about the dataset.

In [3]:
df = pd.read_csv("persona.csv")

In [4]:
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [5]:
df.shape

(5000, 5)

In [7]:
df.isnull().sum()

PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

### Question 2: How many unique SOURCE are there? What are their frequencies?

In [12]:
df["SOURCE"].nunique()

2

In [11]:
df["SOURCE"].unique()

array(['android', 'ios'], dtype=object)

In [13]:
df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

### Question 3: How many unique PRICEs are there?

In [14]:
df["PRICE"].nunique()

6

### Question 4: How many sales were made from which PRICE?

In [15]:
df["PRICE"].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

### Question 5: How many sales were made from which country?

In [19]:
df.groupby("COUNTRY")["PRICE"].count()

COUNTRY
bra    1496
can     230
deu     455
fra     303
tur     451
usa    2065
Name: PRICE, dtype: int64

### Question 6: How much was earned in total from sales by country?

In [21]:
df.groupby("COUNTRY")["PRICE"].sum()

COUNTRY
bra    51354
can     7730
deu    15485
fra    10177
tur    15689
usa    70225
Name: PRICE, dtype: int64

In [23]:
df.pivot_table("PRICE","COUNTRY",aggfunc="sum") # Way 2

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

### Question 7: What are the sales numbers according to SOURCE types?

In [26]:
df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

In [25]:
df.groupby("SOURCE")["PRICE"].count()   # Way 2

SOURCE
android    2974
ios        2026
Name: PRICE, dtype: int64

### Question 8: What are the PRICE averages by country?

In [27]:
df.groupby("COUNTRY")["PRICE"].mean()

COUNTRY
bra    34.327540
can    33.608696
deu    34.032967
fra    33.587459
tur    34.787140
usa    34.007264
Name: PRICE, dtype: float64

### Question 9: What are the PRICE averages according to SOURCEs?

In [29]:
df.groupby("SOURCE")["PRICE"].mean()

SOURCE
android    34.174849
ios        34.069102
Name: PRICE, dtype: float64

### Question 10: What are the PRICE averages in the COUNTRY-SOURCE breakdown?

In [30]:
df.groupby(["COUNTRY","SOURCE"])["PRICE"].mean()

COUNTRY  SOURCE
bra      android    34.387029
         ios        34.222222
can      android    33.330709
         ios        33.951456
deu      android    33.869888
         ios        34.268817
fra      android    34.312500
         ios        32.776224
tur      android    36.229437
         ios        33.272727
usa      android    33.760357
         ios        34.371703
Name: PRICE, dtype: float64

In [31]:
df.pivot_table(["PRICE"],["COUNTRY","SOURCE"],aggfunc="mean")   # Way 2

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

## TASK 2: What are the average earnings in breakdown of COUNTRY, SOURCE, SEX, AGE?

In [32]:
df.groupby(["COUNTRY","SOURCE","SEX","AGE"])["PRICE"].mean()

COUNTRY  SOURCE   SEX     AGE
bra      android  female  15     38.714286
                          16     35.944444
                          17     35.666667
                          18     32.255814
                          19     35.206897
                                   ...
usa      ios      male    42     30.250000
                          50     39.000000
                          53     34.000000
                          55     29.000000
                          59     46.500000
Name: PRICE, Length: 348, dtype: float64

In [33]:
df.pivot_table(["PRICE"],["COUNTRY","SOURCE","SEX","AGE"],aggfunc="mean")   # Way 2

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

## TASK 3: Sort the output of Task 2 according to PRICE.

In [35]:
agg_df = df.pivot_table(["PRICE"],["COUNTRY","SOURCE","SEX","AGE"],aggfunc="mean").sort_values(by="PRICE", ascending=False)

In [36]:
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

## TASK 4: Convert the names in the index to variable names.

In [38]:
agg_df.reset_index(inplace=True)

In [39]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

## TASK 5: Convert AGE variable to categorical variable and add it to agg_df.

Construct the intervals in whatever way you think will be persuasive.

For example: '0_18', '19_23', '24_30', '31_40', '41_70'

In [68]:
agg_df["AGE_RANGE"] = pd.cut(agg_df["AGE"],[0,18,23,30,40,70], labels=['0_18', '19_23', '24_30', '31_40', '41_70'])

In [69]:
agg_df["AGE_RANGE"].dtypes

CategoricalDtype(categories=['0_18', '19_23', '24_30', '31_40', '41_70'], ordered=True)


### TASK 6: Identify new level based customers and add them as variables to the dataset.

Define a variable named customers_level_based and add this variable to the dataset.

Attention! After creating customers_level_based values with list comp, these values need to be deduplicated.

For example, it could be more than one of the following: USA_ANDROID_MALE_0_18

It is necessary to take them to groupby and get the price averages.

In [79]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_RANGE  CUSTOMERS_LEVEL_BASED
0     bra  android    male   46   59.0     41_70    BRAANDROIDMALE41_70
1     usa  android    male   36   59.0     31_40    USAANDROIDMALE31_40
2     fra  android  female   24   59.0     24_30  FRAANDROIDFEMALE24_30
3     usa      ios    male   32   54.0     31_40        USAIOSMALE31_40
4     deu  android  female   36   49.0     31_40  DEUANDROIDFEMALE31_40

In [77]:
agg_df.values

array([['bra', 'android', 'male', 46, 59.0, '41_70'],
       ['usa', 'android', 'male', 36, 59.0, '31_40'],
       ['fra', 'android', 'female', 24, 59.0, '24_30'],
       ...,
       ['can', 'android', 'female', 27, 19.0, '24_30'],
       ['fra', 'android', 'male', 18, 19.0, '0_18'],
       ['deu', 'android', 'male', 26, 9.0, '24_30']], dtype=object)

In [78]:
agg_df["CUSTOMERS_LEVEL_BASED"] = [col[0].upper()+ col[1].upper()+ col[2].upper() + col[5].upper() for col in agg_df.values]

#agg_df["CUSTOMERS_LEVEL_BASED"] = agg_df[["COUNTRY","SOURCE","SEX","AGE_RANGE"]].apply(lambda x: "_".join(x).upper(), axis=1)  # Way 2

#agg_df["CUSTOMERS_LEVEL_BASED"] = agg_df[["COUNTRY","SOURCE","SEX","AGE_RANGE"]].agg(lambda x: "_".join(x).upper(), axis=1)    # Way 3

#agg_df["CUSTOMERS_LEVEL_BASED"] = agg_df.drop(["AGE","PRICE"], axis=1).agg(lambda x: "_".join(x).upper(), axis=1)    # Way 4

### TASK 7: Segment new customers (USA_ANDROID_MALE_0_18).

* Segment by PRICE,

* add segments to agg_df with "SEGMENT" naming,

* describe the segments,

In [93]:
agg_df["SEGMENT"] = pd.qcut(agg_df["PRICE"],4,labels=["First","Second","Third","Fourth"])

### TASK 8: Classify the new customers and estimate how much income they can bring.

What segment does a 33-year-old Turkish woman using ANDROID belong to and how much income is expected to earn on average?

In [116]:
agg_df[(agg_df["AGE_RANGE"]=="31_40") & (agg_df["SOURCE"]=="android") & (agg_df["COUNTRY"]=="tur")]["SEGMENT"].values

['Fourth', 'Fourth', 'First']
Categories (4, object): ['First' < 'Second' < 'Third' < 'Fourth']

In [113]:
agg_df[(agg_df["AGE_RANGE"]=="31_40") & (agg_df["SOURCE"]=="android") & (agg_df["COUNTRY"]=="tur")].groupby("SEGMENT").agg({"PRICE":"mean"})

             PRICE
SEGMENT
First    29.000000
Second         NaN
Third          NaN
Fourth   41.833333

In which segment and on average how much income would a 35-year-old French woman using iOS expect to earn?

In [119]:
agg_df[(agg_df["AGE_RANGE"]=="31_40") & (agg_df["SOURCE"]=="ios") & (agg_df["COUNTRY"]=="fra")]["SEGMENT"].values

['Fourth', 'Second', 'Second', 'First']
Categories (4, object): ['First' < 'Second' < 'Third' < 'Fourth']

In [120]:
agg_df[(agg_df["AGE_RANGE"]=="31_40") & (agg_df["SOURCE"]=="ios") & (agg_df["COUNTRY"]=="fra")].groupby("SEGMENT").agg({"PRICE":"mean"})

             PRICE
SEGMENT
First    29.000000
Second   32.818182
Third          NaN
Fourth   38.375000